zuzya3010/hoverboard-AT32F413RCT7/Drivers/AT32F4xx_HAL_Driver/Src/at32f4xx_hal_rcc_ex.c
// /**
  // * @brief  Enable PLLI2S
  // * @param  PLLI2SInit pointer to an RCC_PLLI2SInitTypeDef structure that
  // *         contains the configuration information for the PLLI2S
  // * @note   The PLLI2S configuration not modified if used by I2S2 or I2S3 Interface.
  // * @retval HAL status
  // */
// HAL_StatusTypeDef HAL_RCCEx_EnablePLLI2S(RCC_PLLI2SInitTypeDef  *PLLI2SInit)
// {
  // uint32_t tickstart = 0U;

  // /* Check that PLL I2S has not been already enabled by I2S2 or I2S3*/
  // if (HAL_IS_BIT_CLR(RCC->CFGR2, RCC_CFGR2_I2S2SRC) && HAL_IS_BIT_CLR(RCC->CFGR2, RCC_CFGR2_I2S3SRC))
  // {
    // /* Check the parameters */
    // assert_param(IS_RCC_PLLI2S_MUL(PLLI2SInit->PLLI2SMUL));
    // assert_param(IS_RCC_HSE_PREDIV2(PLLI2SInit->HSEPrediv2Value));

    // /* Prediv2 can be written only when the PLL2 is disabled. */
    // /* Return an error only if new value is different from the programmed value */
    // if (HAL_IS_BIT_SET(RCC->CR,RCC_CR_PLL2ON) && \
      // (__HAL_RCC_HSE_GET_PREDIV2() != PLLI2SInit->HSEPrediv2Value))
    // {
      // return HAL_ERROR;
    // }

    // /* Disable the main PLLI2S. */
    // __HAL_RCC_PLLI2S_DISABLE();

    // /* Get Start Tick*/
    // tickstart = HAL_GetTick();
    
    // /* Wait till PLLI2S is ready */  
    // while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLI2SRDY)  != RESET)
    // {
      // if((HAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
      // {
        // return HAL_TIMEOUT;
      // }
    // }

    // /* Configure the HSE prediv2 factor --------------------------------*/
    // __HAL_RCC_HSE_PREDIV2_CONFIG(PLLI2SInit->HSEPrediv2Value);
    

    // /* Configure the main PLLI2S multiplication factors. */
    // __HAL_RCC_PLLI2S_CONFIG(PLLI2SInit->PLLI2SMUL);
    
    // /* Enable the main PLLI2S. */
    // __HAL_RCC_PLLI2S_ENABLE();
    
    // /* Get Start Tick*/
    // tickstart = HAL_GetTick();
    
    // /* Wait till PLLI2S is ready */
    // while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLI2SRDY)  == RESET)
    // {
      // if((HAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
      // {
        // return HAL_TIMEOUT;
      // }
    // }
  // }
  // else
  // {
    // /* PLLI2S cannot be modified as already used by I2S2 or I2S3 */
    // return HAL_ERROR;
  // }

  // return HAL_OK;
// }

// /**
  // * @brief  Disable PLLI2S
  // * @note   PLLI2S is not disabled if used by I2S2 or I2S3 Interface.
  // * @retval HAL status
  // */
// HAL_StatusTypeDef HAL_RCCEx_DisablePLLI2S(void)
// {
  // uint32_t tickstart = 0U;

  // /* Disable PLL I2S as not requested by I2S2 or I2S3*/
  // if (HAL_IS_BIT_CLR(RCC->CFGR2, RCC_CFGR2_I2S2SRC) && HAL_IS_BIT_CLR(RCC->CFGR2, RCC_CFGR2_I2S3SRC))
  // {
    // /* Disable the main PLLI2S. */
    // __HAL_RCC_PLLI2S_DISABLE();

    // /* Get Start Tick*/
    // tickstart = HAL_GetTick();
    
    // /* Wait till PLLI2S is ready */  
    // while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLI2SRDY)  != RESET)
    // {
      // if((HAL_GetTick() - tickstart ) > PLLI2S_TIMEOUT_VALUE)
      // {
        // return HAL_TIMEOUT;
      // }
    // }
  // }
  // else
  // {
    // /* PLLI2S is currently used by I2S2 or I2S3. Cannot be disabled.*/
    // return HAL_ERROR;
  // }
  
  // return HAL_OK;
// }

// /**
  // * @}
  // */

// /** @defgroup RCCEx_Exported_Functions_Group3 PLL2 Management function
  // *  @brief  PLL2 Management functions
  // *
// @verbatim   
 // ===============================================================================
                // ##### Extended PLL2 Management functions  #####
 // ===============================================================================  
    // [..]
    // This subsection provides a set of functions allowing to control the PLL2
    // activation or deactivation
// @endverbatim
  // * @{
  // */

// /**
  // * @brief  Enable PLL2
  // * @param  PLL2Init pointer to an RCC_PLL2InitTypeDef structure that
  // *         contains the configuration information for the PLL2
  // * @note   The PLL2 configuration not modified if used indirectly as system clock.
  // * @retval HAL status
  // */
// HAL_StatusTypeDef HAL_RCCEx_EnablePLL2(RCC_PLL2InitTypeDef  *PLL2Init)
// {
  // uint32_t tickstart = 0U;

  // /* This bit can not be cleared if the PLL2 clock is used indirectly as system 
    // clock (i.e. it is used as PLL clock entry that is used as system clock). */
  // if((__HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSE) && \
        // (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && \
        // ((READ_BIT(RCC->CFGR2,RCC_CFGR2_PREDIV1SRC)) == RCC_CFGR2_PREDIV1SRC_PLL2))
  // {
    // return HAL_ERROR;
  // }
  // else
  // {
    // /* Check the parameters */
    // assert_param(IS_RCC_PLL2_MUL(PLL2Init->PLL2MUL));
    // assert_param(IS_RCC_HSE_PREDIV2(PLL2Init->HSEPrediv2Value));

    // /* Prediv2 can be written only when the PLLI2S is disabled. */
    // /* Return an error only if new value is different from the programmed value */
    // if (HAL_IS_BIT_SET(RCC->CR,RCC_CR_PLL3ON) && \
      // (__HAL_RCC_HSE_GET_PREDIV2() != PLL2Init->HSEPrediv2Value))
    // {
      // return HAL_ERROR;
    // }

    // /* Disable the main PLL2. */
    // __HAL_RCC_PLL2_DISABLE();
    
    // /* Get Start Tick*/
    // tickstart = HAL_GetTick();
    
    // /* Wait till PLL2 is disabled */
    // while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY) != RESET)
    // {
      // if((HAL_GetTick() - tickstart ) > PLL2_TIMEOUT_VALUE)
      // {
        // return HAL_TIMEOUT;
      // }
    // }
    
    // /* Configure the HSE prediv2 factor --------------------------------*/
    // __HAL_RCC_HSE_PREDIV2_CONFIG(PLL2Init->HSEPrediv2Value);

    // /* Configure the main PLL2 multiplication factors. */
    // __HAL_RCC_PLL2_CONFIG(PLL2Init->PLL2MUL);
    
    // /* Enable the main PLL2. */
    // __HAL_RCC_PLL2_ENABLE();
    
    // /* Get Start Tick*/
    // tickstart = HAL_GetTick();
    
    // /* Wait till PLL2 is ready */
    // while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY)  == RESET)
    // {
      // if((HAL_GetTick() - tickstart ) > PLL2_TIMEOUT_VALUE)
      // {
        // return HAL_TIMEOUT;
      // }
    // }
  // }

  // return HAL_OK;
// }

// /**
  // * @brief  Disable PLL2
  // * @note   PLL2 is not disabled if used indirectly as system clock.
  // * @retval HAL status
  // */
// HAL_StatusTypeDef HAL_RCCEx_DisablePLL2(void)
// {
  // uint32_t tickstart = 0U;

  // /* This bit can not be cleared if the PLL2 clock is used indirectly as system 
    // clock (i.e. it is used as PLL clock entry that is used as system clock). */
  // if((__HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSE) && \
        // (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && \
        // ((READ_BIT(RCC->CFGR2,RCC_CFGR2_PREDIV1SRC)) == RCC_CFGR2_PREDIV1SRC_PLL2))
  // {
    // return HAL_ERROR;
  // }
  // else
  // {
    // /* Disable the main PLL2. */
    // __HAL_RCC_PLL2_DISABLE();

    // /* Get Start Tick*/
    // tickstart = HAL_GetTick();
    
    // /* Wait till PLL2 is disabled */  
    // while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLL2RDY)  != RESET)
    // {
      // if((HAL_GetTick() - tickstart ) > PLL2_TIMEOUT_VALUE)
      // {
        // return HAL_TIMEOUT;
      // }
    // }
  // }

  // return HAL_OK;
// }

// /**
  // * @}
  // */
// #endif /* STM32F105xC || STM32F107xC */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

